grevaillot/svd_tools/headers/ATSAMV71J20B/usart1.h
/** @defgroup usart1_us_mr_spi_mode USMRSPIMODE Mode Register
@{*/

/** USART1_US_MR_SPI_MODE_WRDBT Wait Read Data Before Transfer **/
#define USART1_US_MR_SPI_MODE_WRDBT		(1 << 20)
/** USART1_US_MR_SPI_MODE_CLKO Clock Output Select **/
#define USART1_US_MR_SPI_MODE_CLKO		(1 << 18)
/** USART1_US_MR_SPI_MODE_CPOL SPI Clock Polarity **/
#define USART1_US_MR_SPI_MODE_CPOL		(1 << 16)
/** USART1_US_MR_SPI_MODE_CPHA SPI Clock Phase **/
#define USART1_US_MR_SPI_MODE_CPHA		(1 << 8)

#define USART1_US_MR_SPI_MODE_CHRL_SHIFT		6
#define USART1_US_MR_SPI_MODE_CHRL_MASK		0x03
/** @defgroup usart1_us_mr_spi_mode_chrl CHRL Character Length
@{*/
/**@}*/


#define USART1_US_MR_SPI_MODE_USCLKS_SHIFT		4
#define USART1_US_MR_SPI_MODE_USCLKS_MASK		0x03
/** @defgroup usart1_us_mr_spi_mode_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART1_US_MR_SPI_MODE_USART_MODE_SHIFT		0
#define USART1_US_MR_SPI_MODE_USART_MODE_MASK		0x0f
/** @defgroup usart1_us_mr_spi_mode_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_ier_usart_mode USIERUSARTMODE Interrupt Enable Register
@{*/

/** USART1_US_IER_USART_MODE_MANE Manchester Error Interrupt Enable **/
#define USART1_US_IER_USART_MODE_MANE		(1 << 24)
/** USART1_US_IER_USART_MODE_CTSIC Clear to Send Input Change Interrupt Enable **/
#define USART1_US_IER_USART_MODE_CTSIC		(1 << 19)
/** USART1_US_IER_USART_MODE_DCDIC Data Carrier Detect Input Change Interrupt Enable **/
#define USART1_US_IER_USART_MODE_DCDIC		(1 << 18)
/** USART1_US_IER_USART_MODE_DSRIC Data Set Ready Input Change Enable **/
#define USART1_US_IER_USART_MODE_DSRIC		(1 << 17)
/** USART1_US_IER_USART_MODE_RIIC Ring Indicator Input Change Enable **/
#define USART1_US_IER_USART_MODE_RIIC		(1 << 16)
/** USART1_US_IER_USART_MODE_NACK Non Acknowledge Interrupt Enable **/
#define USART1_US_IER_USART_MODE_NACK		(1 << 13)
/** USART1_US_IER_USART_MODE_ITER Max number of Repetitions Reached Interrupt Enable **/
#define USART1_US_IER_USART_MODE_ITER		(1 << 10)
/** USART1_US_IER_USART_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART1_US_IER_USART_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IER_USART_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IER_USART_MODE_OVRE		(1 << 5)
/** USART1_US_IER_USART_MODE_RXBRK Receiver Break Interrupt Enable **/
#define USART1_US_IER_USART_MODE_RXBRK		(1 << 2)
/** USART1_US_IER_USART_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART1_US_IER_USART_MODE_TXRDY		(1 << 1)
/** USART1_US_IER_USART_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART1_US_IER_USART_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_ier_usart_lin_mode USIERUSARTLINMODE Interrupt Enable Register
@{*/

/** USART1_US_IER_USART_LIN_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART1_US_IER_USART_LIN_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IER_USART_LIN_MODE_TIMEOUT Timeout Interrupt Enable **/
#define USART1_US_IER_USART_LIN_MODE_TIMEOUT		(1 << 8)
/** USART1_US_IER_USART_LIN_MODE_PARE Parity Error Interrupt Enable **/
#define USART1_US_IER_USART_LIN_MODE_PARE		(1 << 7)
/** USART1_US_IER_USART_LIN_MODE_FRAME Framing Error Interrupt Enable **/
#define USART1_US_IER_USART_LIN_MODE_FRAME		(1 << 6)
/** USART1_US_IER_USART_LIN_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IER_USART_LIN_MODE_OVRE		(1 << 5)
/** USART1_US_IER_USART_LIN_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART1_US_IER_USART_LIN_MODE_TXRDY		(1 << 1)
/** USART1_US_IER_USART_LIN_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART1_US_IER_USART_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_ier_spi_mode USIERSPIMODE Interrupt Enable Register
@{*/

/** USART1_US_IER_SPI_MODE_NSSE NSS Line (Driving CTS Pin) Rising or Falling Edge Event **/
#define USART1_US_IER_SPI_MODE_NSSE		(1 << 19)
/** USART1_US_IER_SPI_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART1_US_IER_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IER_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IER_SPI_MODE_OVRE		(1 << 5)
/** USART1_US_IER_SPI_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART1_US_IER_SPI_MODE_TXRDY		(1 << 1)
/** USART1_US_IER_SPI_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART1_US_IER_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_ier_lin_mode USIERLINMODE Interrupt Enable Register
@{*/

/** USART1_US_IER_LIN_MODE_LINHTE LIN Header Timeout Error Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINHTE		(1 << 31)
/** USART1_US_IER_LIN_MODE_LINSTE LIN Synch Tolerance Error Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINSTE		(1 << 30)
/** USART1_US_IER_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINSNRE		(1 << 29)
/** USART1_US_IER_LIN_MODE_LINCE LIN Checksum Error Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINCE		(1 << 28)
/** USART1_US_IER_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINIPE		(1 << 27)
/** USART1_US_IER_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINISFE		(1 << 26)
/** USART1_US_IER_LIN_MODE_LINBE LIN Bus Error Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINBE		(1 << 25)
/** USART1_US_IER_LIN_MODE_LINTC LIN Transfer Completed Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINTC		(1 << 15)
/** USART1_US_IER_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINID		(1 << 14)
/** USART1_US_IER_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_LINBK		(1 << 13)
/** USART1_US_IER_LIN_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IER_LIN_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_OVRE		(1 << 5)
/** USART1_US_IER_LIN_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_TXRDY		(1 << 1)
/** USART1_US_IER_LIN_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART1_US_IER_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

