grevaillot/svd_tools/headers/ATSAMV71J20B/usart1.h
/** @defgroup usart1_us_ier_lon_mode USIERLONMODE Interrupt Enable Register
@{*/

/** USART1_US_IER_LON_MODE_LBLOVFE LON Backlog Overflow Error Interrupt Enable **/
#define USART1_US_IER_LON_MODE_LBLOVFE		(1 << 28)
/** USART1_US_IER_LON_MODE_LRXD LON Reception Done Interrupt Enable **/
#define USART1_US_IER_LON_MODE_LRXD		(1 << 27)
/** USART1_US_IER_LON_MODE_LFET LON Frame Early Termination Interrupt Enable **/
#define USART1_US_IER_LON_MODE_LFET		(1 << 26)
/** USART1_US_IER_LON_MODE_LCOL LON Collision Interrupt Enable **/
#define USART1_US_IER_LON_MODE_LCOL		(1 << 25)
/** USART1_US_IER_LON_MODE_LTXD LON Transmission Done Interrupt Enable **/
#define USART1_US_IER_LON_MODE_LTXD		(1 << 24)
/** USART1_US_IER_LON_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART1_US_IER_LON_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IER_LON_MODE_LCRCE LON CRC Error Interrupt Enable **/
#define USART1_US_IER_LON_MODE_LCRCE		(1 << 7)
/** USART1_US_IER_LON_MODE_LSFE LON Short Frame Error Interrupt Enable **/
#define USART1_US_IER_LON_MODE_LSFE		(1 << 6)
/** USART1_US_IER_LON_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IER_LON_MODE_OVRE		(1 << 5)
/** USART1_US_IER_LON_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART1_US_IER_LON_MODE_TXRDY		(1 << 1)
/** USART1_US_IER_LON_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART1_US_IER_LON_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_ier_lon_spi_mode USIERLONSPIMODE Interrupt Enable Register
@{*/

/** USART1_US_IER_LON_SPI_MODE_UNRE Underrun Error Interrupt Enable **/
#define USART1_US_IER_LON_SPI_MODE_UNRE		(1 << 10)
/** USART1_US_IER_LON_SPI_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART1_US_IER_LON_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IER_LON_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IER_LON_SPI_MODE_OVRE		(1 << 5)
/** USART1_US_IER_LON_SPI_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART1_US_IER_LON_SPI_MODE_TXRDY		(1 << 1)
/** USART1_US_IER_LON_SPI_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART1_US_IER_LON_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_idr_usart_mode USIDRUSARTMODE Interrupt Disable Register
@{*/

/** USART1_US_IDR_USART_MODE_MANE Manchester Error Interrupt Disable **/
#define USART1_US_IDR_USART_MODE_MANE		(1 << 24)
/** USART1_US_IDR_USART_MODE_CTSIC Clear to Send Input Change Interrupt Disable **/
#define USART1_US_IDR_USART_MODE_CTSIC		(1 << 19)
/** USART1_US_IDR_USART_MODE_DCDIC Data Carrier Detect Input Change Interrupt Disable **/
#define USART1_US_IDR_USART_MODE_DCDIC		(1 << 18)
/** USART1_US_IDR_USART_MODE_DSRIC Data Set Ready Input Change Disable **/
#define USART1_US_IDR_USART_MODE_DSRIC		(1 << 17)
/** USART1_US_IDR_USART_MODE_RIIC Ring Indicator Input Change Disable **/
#define USART1_US_IDR_USART_MODE_RIIC		(1 << 16)
/** USART1_US_IDR_USART_MODE_NACK Non Acknowledge Interrupt Disable **/
#define USART1_US_IDR_USART_MODE_NACK		(1 << 13)
/** USART1_US_IDR_USART_MODE_ITER Max Number of Repetitions Reached Interrupt Disable **/
#define USART1_US_IDR_USART_MODE_ITER		(1 << 10)
/** USART1_US_IDR_USART_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART1_US_IDR_USART_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IDR_USART_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IDR_USART_MODE_OVRE		(1 << 5)
/** USART1_US_IDR_USART_MODE_RXBRK Receiver Break Interrupt Disable **/
#define USART1_US_IDR_USART_MODE_RXBRK		(1 << 2)
/** USART1_US_IDR_USART_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART1_US_IDR_USART_MODE_TXRDY		(1 << 1)
/** USART1_US_IDR_USART_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART1_US_IDR_USART_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_idr_usart_lin_mode USIDRUSARTLINMODE Interrupt Disable Register
@{*/

/** USART1_US_IDR_USART_LIN_MODE_DCDIC Data Carrier Detect Input Change Interrupt Disable **/
#define USART1_US_IDR_USART_LIN_MODE_DCDIC		(1 << 18)
/** USART1_US_IDR_USART_LIN_MODE_DSRIC Data Set Ready Input Change Disable **/
#define USART1_US_IDR_USART_LIN_MODE_DSRIC		(1 << 17)
/** USART1_US_IDR_USART_LIN_MODE_RIIC Ring Indicator Input Change Disable **/
#define USART1_US_IDR_USART_LIN_MODE_RIIC		(1 << 16)
/** USART1_US_IDR_USART_LIN_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART1_US_IDR_USART_LIN_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IDR_USART_LIN_MODE_TIMEOUT Timeout Interrupt Disable **/
#define USART1_US_IDR_USART_LIN_MODE_TIMEOUT		(1 << 8)
/** USART1_US_IDR_USART_LIN_MODE_PARE Parity Error Interrupt Disable **/
#define USART1_US_IDR_USART_LIN_MODE_PARE		(1 << 7)
/** USART1_US_IDR_USART_LIN_MODE_FRAME Framing Error Interrupt Disable **/
#define USART1_US_IDR_USART_LIN_MODE_FRAME		(1 << 6)
/** USART1_US_IDR_USART_LIN_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IDR_USART_LIN_MODE_OVRE		(1 << 5)
/** USART1_US_IDR_USART_LIN_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART1_US_IDR_USART_LIN_MODE_TXRDY		(1 << 1)
/** USART1_US_IDR_USART_LIN_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART1_US_IDR_USART_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_idr_spi_mode USIDRSPIMODE Interrupt Disable Register
@{*/

/** USART1_US_IDR_SPI_MODE_NSSE NSS Line (Driving CTS Pin) Rising or Falling Edge Event **/
#define USART1_US_IDR_SPI_MODE_NSSE		(1 << 19)
/** USART1_US_IDR_SPI_MODE_DCDIC Data Carrier Detect Input Change Interrupt Disable **/
#define USART1_US_IDR_SPI_MODE_DCDIC		(1 << 18)
/** USART1_US_IDR_SPI_MODE_DSRIC Data Set Ready Input Change Disable **/
#define USART1_US_IDR_SPI_MODE_DSRIC		(1 << 17)
/** USART1_US_IDR_SPI_MODE_RIIC Ring Indicator Input Change Disable **/
#define USART1_US_IDR_SPI_MODE_RIIC		(1 << 16)
/** USART1_US_IDR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART1_US_IDR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IDR_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IDR_SPI_MODE_OVRE		(1 << 5)
/** USART1_US_IDR_SPI_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART1_US_IDR_SPI_MODE_TXRDY		(1 << 1)
/** USART1_US_IDR_SPI_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART1_US_IDR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_idr_lin_mode USIDRLINMODE Interrupt Disable Register
@{*/

/** USART1_US_IDR_LIN_MODE_LINHTE LIN Header Timeout Error Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINHTE		(1 << 31)
/** USART1_US_IDR_LIN_MODE_LINSTE LIN Synch Tolerance Error Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINSTE		(1 << 30)
/** USART1_US_IDR_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINSNRE		(1 << 29)
/** USART1_US_IDR_LIN_MODE_LINCE LIN Checksum Error Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINCE		(1 << 28)
/** USART1_US_IDR_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINIPE		(1 << 27)
/** USART1_US_IDR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINISFE		(1 << 26)
/** USART1_US_IDR_LIN_MODE_LINBE LIN Bus Error Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINBE		(1 << 25)
/** USART1_US_IDR_LIN_MODE_DCDIC Data Carrier Detect Input Change Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_DCDIC		(1 << 18)
/** USART1_US_IDR_LIN_MODE_DSRIC Data Set Ready Input Change Disable **/
#define USART1_US_IDR_LIN_MODE_DSRIC		(1 << 17)
/** USART1_US_IDR_LIN_MODE_RIIC Ring Indicator Input Change Disable **/
#define USART1_US_IDR_LIN_MODE_RIIC		(1 << 16)
/** USART1_US_IDR_LIN_MODE_LINTC LIN Transfer Completed Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINTC		(1 << 15)
/** USART1_US_IDR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINID		(1 << 14)
/** USART1_US_IDR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_LINBK		(1 << 13)
/** USART1_US_IDR_LIN_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IDR_LIN_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IDR_LIN_MODE_OVRE		(1 << 5)
/** USART1_US_IDR_LIN_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_TXRDY		(1 << 1)
/** USART1_US_IDR_LIN_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART1_US_IDR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_idr_lon_mode USIDRLONMODE Interrupt Disable Register
@{*/

/** USART1_US_IDR_LON_MODE_LBLOVFE LON Backlog Overflow Error Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_LBLOVFE		(1 << 28)
/** USART1_US_IDR_LON_MODE_LRXD LON Reception Done Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_LRXD		(1 << 27)
/** USART1_US_IDR_LON_MODE_LFET LON Frame Early Termination Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_LFET		(1 << 26)
/** USART1_US_IDR_LON_MODE_LCOL LON Collision Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_LCOL		(1 << 25)
/** USART1_US_IDR_LON_MODE_LTXD LON Transmission Done Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_LTXD		(1 << 24)
/** USART1_US_IDR_LON_MODE_DCDIC Data Carrier Detect Input Change Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_DCDIC		(1 << 18)
/** USART1_US_IDR_LON_MODE_DSRIC Data Set Ready Input Change Disable **/
#define USART1_US_IDR_LON_MODE_DSRIC		(1 << 17)
/** USART1_US_IDR_LON_MODE_RIIC Ring Indicator Input Change Disable **/
#define USART1_US_IDR_LON_MODE_RIIC		(1 << 16)
/** USART1_US_IDR_LON_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IDR_LON_MODE_LCRCE LON CRC Error Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_LCRCE		(1 << 7)
/** USART1_US_IDR_LON_MODE_LSFE LON Short Frame Error Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_LSFE		(1 << 6)
/** USART1_US_IDR_LON_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IDR_LON_MODE_OVRE		(1 << 5)
/** USART1_US_IDR_LON_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_TXRDY		(1 << 1)
/** USART1_US_IDR_LON_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART1_US_IDR_LON_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_idr_lon_spi_mode USIDRLONSPIMODE Interrupt Disable Register
@{*/

/** USART1_US_IDR_LON_SPI_MODE_DCDIC Data Carrier Detect Input Change Interrupt Disable **/
#define USART1_US_IDR_LON_SPI_MODE_DCDIC		(1 << 18)
/** USART1_US_IDR_LON_SPI_MODE_DSRIC Data Set Ready Input Change Disable **/
#define USART1_US_IDR_LON_SPI_MODE_DSRIC		(1 << 17)
/** USART1_US_IDR_LON_SPI_MODE_RIIC Ring Indicator Input Change Disable **/
#define USART1_US_IDR_LON_SPI_MODE_RIIC		(1 << 16)
/** USART1_US_IDR_LON_SPI_MODE_UNRE SPI Underrun Error Interrupt Disable **/
#define USART1_US_IDR_LON_SPI_MODE_UNRE		(1 << 10)
/** USART1_US_IDR_LON_SPI_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART1_US_IDR_LON_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IDR_LON_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_US_IDR_LON_SPI_MODE_OVRE		(1 << 5)
/** USART1_US_IDR_LON_SPI_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART1_US_IDR_LON_SPI_MODE_TXRDY		(1 << 1)
/** USART1_US_IDR_LON_SPI_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART1_US_IDR_LON_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_imr_usart_mode USIMRUSARTMODE Interrupt Mask Register
@{*/

/** USART1_US_IMR_USART_MODE_MANE Manchester Error Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_MANE		(1 << 24)
/** USART1_US_IMR_USART_MODE_CTSIC Clear to Send Input Change Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_CTSIC		(1 << 19)
/** USART1_US_IMR_USART_MODE_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_DCDIC		(1 << 18)
/** USART1_US_IMR_USART_MODE_DSRIC Data Set Ready Input Change Mask **/
#define USART1_US_IMR_USART_MODE_DSRIC		(1 << 17)
/** USART1_US_IMR_USART_MODE_RIIC Ring Indicator Input Change Mask **/
#define USART1_US_IMR_USART_MODE_RIIC		(1 << 16)
/** USART1_US_IMR_USART_MODE_NACK Non Acknowledge Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_NACK		(1 << 13)
/** USART1_US_IMR_USART_MODE_ITER Max Number of Repetitions Reached Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_ITER		(1 << 10)
/** USART1_US_IMR_USART_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IMR_USART_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_OVRE		(1 << 5)
/** USART1_US_IMR_USART_MODE_RXBRK Receiver Break Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_RXBRK		(1 << 2)
/** USART1_US_IMR_USART_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_TXRDY		(1 << 1)
/** USART1_US_IMR_USART_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART1_US_IMR_USART_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_imr_usart_lin_mode USIMRUSARTLINMODE Interrupt Mask Register
@{*/

/** USART1_US_IMR_USART_LIN_MODE_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART1_US_IMR_USART_LIN_MODE_DCDIC		(1 << 18)
/** USART1_US_IMR_USART_LIN_MODE_DSRIC Data Set Ready Input Change Mask **/
#define USART1_US_IMR_USART_LIN_MODE_DSRIC		(1 << 17)
/** USART1_US_IMR_USART_LIN_MODE_RIIC Ring Indicator Input Change Mask **/
#define USART1_US_IMR_USART_LIN_MODE_RIIC		(1 << 16)
/** USART1_US_IMR_USART_LIN_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART1_US_IMR_USART_LIN_MODE_TXEMPTY		(1 << 9)
/** USART1_US_IMR_USART_LIN_MODE_TIMEOUT Timeout Interrupt Mask **/
#define USART1_US_IMR_USART_LIN_MODE_TIMEOUT		(1 << 8)
/** USART1_US_IMR_USART_LIN_MODE_PARE Parity Error Interrupt Mask **/
#define USART1_US_IMR_USART_LIN_MODE_PARE		(1 << 7)
/** USART1_US_IMR_USART_LIN_MODE_FRAME Framing Error Interrupt Mask **/
#define USART1_US_IMR_USART_LIN_MODE_FRAME		(1 << 6)
/** USART1_US_IMR_USART_LIN_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART1_US_IMR_USART_LIN_MODE_OVRE		(1 << 5)
/** USART1_US_IMR_USART_LIN_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART1_US_IMR_USART_LIN_MODE_TXRDY		(1 << 1)
/** USART1_US_IMR_USART_LIN_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART1_US_IMR_USART_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_imr_spi_mode USIMRSPIMODE Interrupt Mask Register
@{*/

