grevaillot/svd_tools/headers/ATSAMV71J20B/usart1.h
/** @defgroup usart1_us_csr_usart_lin_mode USCSRUSARTLINMODE Channel Status Register
@{*/

/** USART1_US_CSR_USART_LIN_MODE_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART1_US_CSR_USART_LIN_MODE_DCDIC		(1 << 18)
/** USART1_US_CSR_USART_LIN_MODE_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART1_US_CSR_USART_LIN_MODE_DSRIC		(1 << 17)
/** USART1_US_CSR_USART_LIN_MODE_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART1_US_CSR_USART_LIN_MODE_RIIC		(1 << 16)
/** USART1_US_CSR_USART_LIN_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART1_US_CSR_USART_LIN_MODE_TXEMPTY		(1 << 9)
/** USART1_US_CSR_USART_LIN_MODE_TIMEOUT Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) **/
#define USART1_US_CSR_USART_LIN_MODE_TIMEOUT		(1 << 8)
/** USART1_US_CSR_USART_LIN_MODE_PARE Parity Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_US_CSR_USART_LIN_MODE_PARE		(1 << 7)
/** USART1_US_CSR_USART_LIN_MODE_FRAME Framing Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_US_CSR_USART_LIN_MODE_FRAME		(1 << 6)
/** USART1_US_CSR_USART_LIN_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_US_CSR_USART_LIN_MODE_OVRE		(1 << 5)
/** USART1_US_CSR_USART_LIN_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART1_US_CSR_USART_LIN_MODE_TXRDY		(1 << 1)
/** USART1_US_CSR_USART_LIN_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART1_US_CSR_USART_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_csr_spi_mode USCSRSPIMODE Channel Status Register
@{*/

/** USART1_US_CSR_SPI_MODE_NSS Image of NSS Line **/
#define USART1_US_CSR_SPI_MODE_NSS		(1 << 23)
/** USART1_US_CSR_SPI_MODE_NSSE NSS Line (Driving CTS Pin) Rising or Falling Edge Event **/
#define USART1_US_CSR_SPI_MODE_NSSE		(1 << 19)
/** USART1_US_CSR_SPI_MODE_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART1_US_CSR_SPI_MODE_DCDIC		(1 << 18)
/** USART1_US_CSR_SPI_MODE_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART1_US_CSR_SPI_MODE_DSRIC		(1 << 17)
/** USART1_US_CSR_SPI_MODE_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART1_US_CSR_SPI_MODE_RIIC		(1 << 16)
/** USART1_US_CSR_SPI_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART1_US_CSR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_US_CSR_SPI_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_US_CSR_SPI_MODE_OVRE		(1 << 5)
/** USART1_US_CSR_SPI_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART1_US_CSR_SPI_MODE_TXRDY		(1 << 1)
/** USART1_US_CSR_SPI_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART1_US_CSR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_csr_lin_mode USCSRLINMODE Channel Status Register
@{*/

/** USART1_US_CSR_LIN_MODE_LINHTE LIN Header Timeout Error **/
#define USART1_US_CSR_LIN_MODE_LINHTE		(1 << 31)
/** USART1_US_CSR_LIN_MODE_LINSTE LIN Synch Tolerance Error **/
#define USART1_US_CSR_LIN_MODE_LINSTE		(1 << 30)
/** USART1_US_CSR_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Mask **/
#define USART1_US_CSR_LIN_MODE_LINSNRE		(1 << 29)
/** USART1_US_CSR_LIN_MODE_LINCE LIN Checksum Error **/
#define USART1_US_CSR_LIN_MODE_LINCE		(1 << 28)
/** USART1_US_CSR_LIN_MODE_LINIPE LIN Identifier Parity Error **/
#define USART1_US_CSR_LIN_MODE_LINIPE		(1 << 27)
/** USART1_US_CSR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error **/
#define USART1_US_CSR_LIN_MODE_LINISFE		(1 << 26)
/** USART1_US_CSR_LIN_MODE_LINBE LIN Bus Error **/
#define USART1_US_CSR_LIN_MODE_LINBE		(1 << 25)
/** USART1_US_CSR_LIN_MODE_LINBLS LIN Bus Line Status **/
#define USART1_US_CSR_LIN_MODE_LINBLS		(1 << 23)
/** USART1_US_CSR_LIN_MODE_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART1_US_CSR_LIN_MODE_DCDIC		(1 << 18)
/** USART1_US_CSR_LIN_MODE_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART1_US_CSR_LIN_MODE_DSRIC		(1 << 17)
/** USART1_US_CSR_LIN_MODE_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART1_US_CSR_LIN_MODE_RIIC		(1 << 16)
/** USART1_US_CSR_LIN_MODE_LINTC LIN Transfer Completed **/
#define USART1_US_CSR_LIN_MODE_LINTC		(1 << 15)
/** USART1_US_CSR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received **/
#define USART1_US_CSR_LIN_MODE_LINID		(1 << 14)
/** USART1_US_CSR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received **/
#define USART1_US_CSR_LIN_MODE_LINBK		(1 << 13)
/** USART1_US_CSR_LIN_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART1_US_CSR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART1_US_CSR_LIN_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_US_CSR_LIN_MODE_OVRE		(1 << 5)
/** USART1_US_CSR_LIN_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART1_US_CSR_LIN_MODE_TXRDY		(1 << 1)
/** USART1_US_CSR_LIN_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART1_US_CSR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_csr_lon_mode USCSRLONMODE Channel Status Register
@{*/

/** USART1_US_CSR_LON_MODE_LBLOVFE LON Backlog Overflow Error **/
#define USART1_US_CSR_LON_MODE_LBLOVFE		(1 << 28)
/** USART1_US_CSR_LON_MODE_LRXD LON Reception End Flag **/
#define USART1_US_CSR_LON_MODE_LRXD		(1 << 27)
/** USART1_US_CSR_LON_MODE_LFET LON Frame Early Termination **/
#define USART1_US_CSR_LON_MODE_LFET		(1 << 26)
/** USART1_US_CSR_LON_MODE_LCOL LON Collision Detected Flag **/
#define USART1_US_CSR_LON_MODE_LCOL		(1 << 25)
/** USART1_US_CSR_LON_MODE_LTXD LON Transmission End Flag **/
#define USART1_US_CSR_LON_MODE_LTXD		(1 << 24)
/** USART1_US_CSR_LON_MODE_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART1_US_CSR_LON_MODE_DCDIC		(1 << 18)
/** USART1_US_CSR_LON_MODE_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART1_US_CSR_LON_MODE_DSRIC		(1 << 17)
/** USART1_US_CSR_LON_MODE_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART1_US_CSR_LON_MODE_RIIC		(1 << 16)
/** USART1_US_CSR_LON_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART1_US_CSR_LON_MODE_TXEMPTY		(1 << 9)
/** USART1_US_CSR_LON_MODE_LCRCE LON CRC Error **/
#define USART1_US_CSR_LON_MODE_LCRCE		(1 << 7)
/** USART1_US_CSR_LON_MODE_LSFE LON Short Frame Error **/
#define USART1_US_CSR_LON_MODE_LSFE		(1 << 6)
/** USART1_US_CSR_LON_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_US_CSR_LON_MODE_OVRE		(1 << 5)
/** USART1_US_CSR_LON_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART1_US_CSR_LON_MODE_TXRDY		(1 << 1)
/** USART1_US_CSR_LON_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART1_US_CSR_LON_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_csr_lon_spi_mode USCSRLONSPIMODE Channel Status Register
@{*/

/** USART1_US_CSR_LON_SPI_MODE_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART1_US_CSR_LON_SPI_MODE_DCDIC		(1 << 18)
/** USART1_US_CSR_LON_SPI_MODE_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART1_US_CSR_LON_SPI_MODE_DSRIC		(1 << 17)
/** USART1_US_CSR_LON_SPI_MODE_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART1_US_CSR_LON_SPI_MODE_RIIC		(1 << 16)
/** USART1_US_CSR_LON_SPI_MODE_UNRE SPI Underrun Error **/
#define USART1_US_CSR_LON_SPI_MODE_UNRE		(1 << 10)
/** USART1_US_CSR_LON_SPI_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART1_US_CSR_LON_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_US_CSR_LON_SPI_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_US_CSR_LON_SPI_MODE_OVRE		(1 << 5)
/** USART1_US_CSR_LON_SPI_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART1_US_CSR_LON_SPI_MODE_TXRDY		(1 << 1)
/** USART1_US_CSR_LON_SPI_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART1_US_CSR_LON_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_us_rhr USRHR Receive Holding Register
@{*/

/** USART1_US_RHR_RXSYNH Received Sync **/
#define USART1_US_RHR_RXSYNH		(1 << 15)

#define USART1_US_RHR_RXCHR_SHIFT		0
#define USART1_US_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart1_us_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_thr USTHR Transmit Holding Register
@{*/

/** USART1_US_THR_TXSYNH Sync Field to be Transmitted **/
#define USART1_US_THR_TXSYNH		(1 << 15)

#define USART1_US_THR_TXCHR_SHIFT		0
#define USART1_US_THR_TXCHR_MASK		0x1ff
/** @defgroup usart1_us_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

