grevaillot/svd_tools/headers/ATSAMV71J20B/usart1.h
/** @defgroup usart1_us_lonl2hdr USLONL2HDR LON L2HDR Register
@{*/

/** USART1_US_LONL2HDR_PB LON Priority Bit **/
#define USART1_US_LONL2HDR_PB		(1 << 7)
/** USART1_US_LONL2HDR_ALTP LON Alternate Path Bit **/
#define USART1_US_LONL2HDR_ALTP		(1 << 6)

#define USART1_US_LONL2HDR_BLI_SHIFT		0
#define USART1_US_LONL2HDR_BLI_MASK		0x3f
/** @defgroup usart1_us_lonl2hdr_bli BLI LON Backlog Increment
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_lonbl USLONBL LON Backlog Register
@{*/


#define USART1_US_LONBL_LONBL_SHIFT		0
#define USART1_US_LONBL_LONBL_MASK		0x3f
/** @defgroup usart1_us_lonbl_lonbl LONBL LON Node Backlog Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_lonb1tx USLONB1TX LON Beta1 Tx Register
@{*/


#define USART1_US_LONB1TX_BETA1TX_SHIFT		0
#define USART1_US_LONB1TX_BETA1TX_MASK		0xffffff
/** @defgroup usart1_us_lonb1tx_beta1tx BETA1TX LON Beta1 Length after Transmission
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_lonb1rx USLONB1RX LON Beta1 Rx Register
@{*/


#define USART1_US_LONB1RX_BETA1RX_SHIFT		0
#define USART1_US_LONB1RX_BETA1RX_MASK		0xffffff
/** @defgroup usart1_us_lonb1rx_beta1rx BETA1RX LON Beta1 Length after Reception
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_lonprio USLONPRIO LON Priority Register
@{*/


#define USART1_US_LONPRIO_NPS_SHIFT		8
#define USART1_US_LONPRIO_NPS_MASK		0x7f
/** @defgroup usart1_us_lonprio_nps NPS LON Node Priority Slot
@{*/
/**@}*/


#define USART1_US_LONPRIO_PSNB_SHIFT		0
#define USART1_US_LONPRIO_PSNB_MASK		0x7f
/** @defgroup usart1_us_lonprio_psnb PSNB LON Priority Slot Number
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_idttx USIDTTX LON IDT Tx Register
@{*/


#define USART1_US_IDTTX_IDTTX_SHIFT		0
#define USART1_US_IDTTX_IDTTX_MASK		0xffffff
/** @defgroup usart1_us_idttx_idttx IDTTX LON Indeterminate Time after Transmission (comm_type = 1 mode only)
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_idtrx USIDTRX LON IDT Rx Register
@{*/


#define USART1_US_IDTRX_IDTRX_SHIFT		0
#define USART1_US_IDTRX_IDTRX_MASK		0xffffff
/** @defgroup usart1_us_idtrx_idtrx IDTRX LON Indeterminate Time after Reception (comm_type = 1 mode only)
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_icdiff USICDIFF IC DIFF Register
@{*/


#define USART1_US_ICDIFF_ICDIFF_SHIFT		0
#define USART1_US_ICDIFF_ICDIFF_MASK		0x0f
/** @defgroup usart1_us_icdiff_icdiff ICDIFF IC Differentiator Number
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_us_wpmr USWPMR Write Protection Mode Register
@{*/


#define USART1_US_WPMR_WPKEY_SHIFT		8
#define USART1_US_WPMR_WPKEY_MASK		0xffffff
/** @defgroup usart1_us_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** USART1_US_WPMR_WPEN Write Protection Enable **/
#define USART1_US_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup usart1_us_wpsr USWPSR Write Protection Status Register
@{*/


#define USART1_US_WPSR_WPVSRC_SHIFT		8
#define USART1_US_WPSR_WPVSRC_MASK		0xffff
/** @defgroup usart1_us_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** USART1_US_WPSR_WPVS Write Protection Violation Status **/
#define USART1_US_WPSR_WPVS		(1 << 0)

/**@}*/
